{
  "project": "office2pdf",
  "branchName": "ralph/phase5-remaining-gaps",
  "description": "Phase 5: Remaining PRD gaps - PPTX gradients, XLSX page breaks, PPTX shape effects, XLSX advanced conditional formatting, performance benchmarks",
  "userStories": [
    {
      "id": "US-050",
      "title": "PPTX parser - gradient background support",
      "description": "As a user, I want gradient backgrounds in PPTX slides to render in the PDF output instead of being ignored.",
      "acceptanceCriteria": [
        "Parse <a:gradFill> elements in slide backgrounds and shape fills",
        "Extract gradient stops: position (pos), color (srgbClr/schemeClr)",
        "Support linear gradient direction (lin ang attribute)",
        "Render gradient as Typst gradient.linear() on page background or shape fill",
        "Fallback: if gradient cannot be rendered, use the first stop color as solid fill",
        "Unit tests: slide with gradient background, shape with gradient fill",
        "cargo test --workspace passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-051",
      "title": "PPTX parser - shape shadow and reflection effects",
      "description": "As a user, I want shadow effects on PPTX shapes to be approximated in the PDF output.",
      "acceptanceCriteria": [
        "Parse <a:effectLst> within shape properties for shadow effects (<a:outerShdw>)",
        "Extract shadow parameters: blur radius, distance, direction, color, opacity",
        "Render shadow as a Typst approximation (e.g., offset duplicate shape with reduced opacity, or use #box(shadow: ...))",
        "Reflection effects: parse but render as best-effort or skip with warning",
        "Unit tests: shape with outer shadow, shape with no effects (no regression)",
        "cargo test --workspace passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-052",
      "title": "XLSX parser - manual page breaks",
      "description": "As a user, I want manual page breaks in XLSX spreadsheets to be reflected in the PDF output.",
      "acceptanceCriteria": [
        "Parse row breaks from sheet XML via sheet.get_row_breaks().get_break_list()",
        "Filter for manual page breaks (get_manual_page_break() == true)",
        "Split table rows into separate TablePages at each page break point",
        "Preserve column widths and cell formatting across page breaks",
        "Unit tests: spreadsheet with manual page break splits into multiple pages",
        "cargo test --workspace passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-053",
      "title": "XLSX parser - DataBar and IconSet conditional formatting",
      "description": "As a user, I want DataBar and IconSet conditional formatting in XLSX to be approximated in the PDF.",
      "acceptanceCriteria": [
        "Parse DataBar conditional formatting rules from XLSX",
        "Render DataBar as a colored bar within the cell (proportional to value range)",
        "Parse IconSet conditional formatting rules from XLSX",
        "Render IconSet as text symbols (e.g., arrows ↑↓→, traffic lights ●) based on thresholds",
        "Unit tests: spreadsheet with DataBar rules, spreadsheet with IconSet rules",
        "cargo test --workspace passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 4,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-054",
      "title": "Performance benchmarks and validation",
      "description": "As a developer, I want benchmark tests to validate the performance targets defined in the PRD.",
      "acceptanceCriteria": [
        "Add Criterion benchmarks for DOCX, PPTX, XLSX conversion (small and medium documents)",
        "Generate synthetic test documents: 10-page DOCX, 10-slide PPTX, 10-sheet XLSX",
        "Benchmark end-to-end conversion time for each format",
        "Document benchmark results in progress notes",
        "Verify 10-page document converts in < 2 seconds on local hardware",
        "cargo test --workspace passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 5,
      "passes": false,
      "notes": "Existing Criterion benchmarks may exist from US-047. Extend or validate them."
    }
  ]
}
