{
  "project": "office2pdf",
  "branchName": "ralph/phase8-foundation-fixes",
  "description": "Phase 8: Foundation Fixes - Metadata extraction, PDF/A timestamp, ignored fixtures, warning taxonomy, PDF validation",
  "userStories": [
    {
      "id": "US-080",
      "title": "Extract document metadata from OOXML core/app properties",
      "description": "All three parsers currently return `Metadata::default()` instead of extracting actual document metadata. This breaks PDF/A compliance and produces PDFs without title/author/dates.\n\nDOCX (`crates/office2pdf/src/parser/docx.rs:825`): Use `docx-rs` API or parse `docProps/core.xml` from the ZIP archive to extract dc:title, dc:creator, dc:subject, dc:description, dcterms:created, dcterms:modified.\n\nPPTX (`crates/office2pdf/src/parser/pptx.rs:110`): The PPTX is already opened as a ZIP archive. Read `docProps/core.xml` and parse it with quick-xml to extract the same Dublin Core fields.\n\nXLSX (`crates/office2pdf/src/parser/xlsx.rs:681`): Use `umya-spreadsheet`'s properties API (if available) or parse `docProps/core.xml` from the ZIP to extract metadata.\n\nThe `Metadata` struct in `crates/office2pdf/src/ir/document.rs` should be populated with: title, author (creator), subject, description, created date, modified date.\n\nCheck the current Metadata struct fields — if fields are missing, add them. The PDF renderer (`crates/office2pdf/src/render/pdf.rs`) should pass these through to the PDF document info dictionary.",
      "acceptanceCriteria": [
        "DOCX parser extracts title, creator, subject, created, modified from core.xml",
        "PPTX parser extracts title, creator, subject, created, modified from core.xml",
        "XLSX parser extracts title, creator, subject, created, modified from core.xml",
        "Metadata struct has fields for title, author, subject, description, created, modified",
        "PDF output contains document info dictionary with extracted metadata",
        "Unit test: DOCX with metadata fields → Metadata struct populated correctly",
        "Unit test: PPTX with metadata fields → Metadata struct populated correctly",
        "Unit test: XLSX with metadata fields → Metadata struct populated correctly",
        "Unit test: document without metadata → Metadata fields are None/empty (no crash)",
        "cargo test --workspace passes",
        "cargo fmt --all -- --check passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": "Dublin Core metadata in OOXML is at `docProps/core.xml`. Fields: <dc:title>, <dc:creator>, <dc:subject>, <dc:description>, <dcterms:created>, <dcterms:modified>. For DOCX, docx-rs may expose properties — check the API first. For PPTX, the ZIP is already open in the parser so adding another file read is straightforward. For XLSX, umya-spreadsheet may have a properties accessor. The Metadata struct may need new Optional<String> fields added."
    },
    {
      "id": "US-081",
      "title": "Replace hardcoded PDF/A timestamp with actual conversion time",
      "description": "In `crates/office2pdf/src/render/pdf.rs:70`, the PDF/A timestamp is hardcoded to `2024-01-01` instead of using the actual conversion time or source document metadata.\n\nFix:\n1. Use `chrono::Utc::now()` (or equivalent) to get the current timestamp at conversion time\n2. If the source document has a `created` or `modified` date in its Metadata, prefer the source metadata for `CreationDate` and use `now()` for `ModDate`\n3. If no source metadata, use `now()` for both\n4. Ensure the timestamp format matches PDF spec requirements (D:YYYYMMDDHHmmSSOHH'mm')\n5. Check if `chrono` is already a dependency — if not, consider using `std::time::SystemTime` with manual formatting to avoid adding a new dependency (per project rules of preferring Rust native implementations)\n\nAlso check if the timestamp is used elsewhere in the PDF output (XMP metadata for PDF/A).",
      "acceptanceCriteria": [
        "PDF/A output contains actual conversion timestamp, not 2024-01-01",
        "If source document has created/modified dates, they are used for CreationDate",
        "ModDate uses actual conversion time",
        "Timestamp format matches PDF specification",
        "No new external dependencies added (use std::time if possible)",
        "Unit test: PDF/A output has non-hardcoded timestamp",
        "cargo test --workspace passes",
        "cargo fmt --all -- --check passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": "Check if typst-pdf handles timestamps internally. The fix may be in how we construct the PdfOptions or PdfStandard configuration passed to typst_pdf::pdf(). Look at how typst-pdf's API accepts metadata — it may have a creation_date field. Prefer std::time::SystemTime over adding chrono as a dependency."
    },
    {
      "id": "US-082",
      "title": "Close ignored DOCX fixture tests (footnotes and headers)",
      "description": "Two structural tests in `crates/office2pdf/tests/docx_fixtures.rs` are marked as `#[ignore]`:\n\n1. Footnote test at line 173 — the DOCX with footnotes is not converting correctly\n2. Headers test at line 361 — the DOCX with headers/footers is not converting correctly\n\nFor each:\n1. Remove the `#[ignore]` attribute\n2. Run the test to see the actual failure\n3. Fix the underlying issue in the parser or codegen\n4. Ensure the test passes\n\nThese may involve issues in:\n- `parser/docx.rs` — footnote/endnote parsing or header/footer parsing\n- `render/typst_gen.rs` — footnote/header rendering in Typst markup\n\nCheck the existing footnote and header parsing code to understand what's partially implemented vs missing.",
      "acceptanceCriteria": [
        "Footnote fixture test at docx_fixtures.rs:173 passes without #[ignore]",
        "Headers fixture test at docx_fixtures.rs:361 passes without #[ignore]",
        "No other tests regress",
        "cargo test --workspace passes",
        "cargo fmt --all -- --check passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 3,
      "passes": false,
      "notes": "First read the test code to understand what fixture file is being used and what the test expects. Then run the test without #[ignore] to see the actual error. The fix might be as simple as a parsing edge case or a Typst codegen issue. Check the progress.txt Codebase Patterns section for any existing notes about footnotes/headers."
    },
    {
      "id": "US-083",
      "title": "Add structured warning taxonomy across all parsers",
      "description": "Currently, warnings are emitted inconsistently across DOCX, PPTX, and XLSX parsers. Some use ConvertWarning variants, others use plain strings or are silently ignored.\n\nCreate a structured warning system:\n1. Review `crates/office2pdf/src/error.rs` — check existing ConvertWarning enum variants\n2. Define a consistent set of warning categories:\n   - `UnsupportedElement(format, element_name)` — element type not supported\n   - `PartialElement(format, element_name, detail)` — element partially rendered\n   - `FallbackUsed(format, from, to)` — fallback rendering applied\n   - `ParseSkipped(format, reason)` — element skipped during parsing\n3. Audit all three parsers for places where elements are silently skipped or fallback-rendered\n4. Replace ad-hoc warning strings with structured ConvertWarning variants\n5. Ensure ConvertResult warnings are collected and returned to the caller\n\nThe goal is that users can programmatically inspect what was degraded in the conversion.",
      "acceptanceCriteria": [
        "ConvertWarning enum has consistent, structured variants",
        "Each warning variant includes the format (DOCX/PPTX/XLSX) and element context",
        "DOCX parser uses structured warnings for unsupported/fallback elements",
        "PPTX parser uses structured warnings for unsupported/fallback elements",
        "XLSX parser uses structured warnings for unsupported/fallback elements",
        "ConvertResult.warnings contains structured warnings after conversion",
        "Unit test: converting a document with unsupported elements produces appropriate warnings",
        "cargo test --workspace passes",
        "cargo fmt --all -- --check passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 4,
      "passes": false,
      "notes": "Start by reading the existing ConvertWarning and ConvertResult types. Then grep across all parsers for places where warnings are generated, elements are skipped (continue statements), or fallbacks are used. The SmartArt and Chart fallbacks in typst_gen.rs are good examples of places that should emit structured warnings. Don't change behavior — just make existing degradation more visible and structured."
    },
    {
      "id": "US-084",
      "title": "Add PDF validation with QPDF in CI test suite",
      "description": "Inspired by fpdf2's practice of validating output with multiple independent PDF checkers, add PDF validation to the test suite.\n\nApproach:\n1. Add a test helper function that validates PDF bytes using QPDF (widely available CLI tool)\n2. In integration tests, after converting a fixture to PDF, validate the output\n3. QPDF validation: `qpdf --check <file>` returns exit code 0 for valid PDFs\n4. If QPDF is not installed, skip validation with a warning (don't fail CI)\n5. Add a CI step to install QPDF and run tests with validation enabled\n\nThe validation should catch:\n- Malformed PDF structure\n- Invalid cross-reference tables\n- Corrupted streams\n- PDF spec violations\n\nImplementation:\n- Create a test utility function in `crates/office2pdf/tests/` or a shared test helper module\n- Use `std::process::Command` to invoke qpdf\n- Feature-gate or environment-variable-gate the validation so it only runs when qpdf is available\n- Add `OFFICE2PDF_VALIDATE_PDF=1` env var to enable validation in CI",
      "acceptanceCriteria": [
        "Test helper function validates PDF bytes via qpdf --check",
        "At least 3 fixture conversion tests include PDF validation",
        "Validation is skipped gracefully if qpdf is not installed",
        "OFFICE2PDF_VALIDATE_PDF env var controls whether validation runs",
        "CI workflow installs qpdf and enables validation",
        "All validated PDFs pass qpdf --check",
        "cargo test --workspace passes (with or without qpdf installed)",
        "cargo fmt --all -- --check passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 5,
      "passes": false,
      "notes": "Check if qpdf is available on GitHub Actions runners (Ubuntu). It's usually installable via `apt-get install qpdf`. For CI, add a step in `.github/workflows/` to install qpdf before running tests. The test helper should write PDF bytes to a temp file, run qpdf --check, parse exit code. VeraPDF (for PDF/A validation) can be added in a later phase as it requires Java."
    }
  ]
}
