{
  "project": "office2pdf",
  "branchName": "ralph/phase9-quality-fidelity",
  "description": "Phase 9: Quality & Fidelity - PPTX geometry, SmartArt/Chart improvement, XLSX chart positioning, font substitution, PDF optimization",
  "userStories": [
    {
      "id": "US-085",
      "title": "Extend PPTX geometry mapping beyond rect/ellipse/line",
      "description": "In `crates/office2pdf/src/parser/pptx.rs:2129`, the PPTX shape geometry mapping is intentionally coarse — many preset geometries (triangles, arrows, stars, pentagons, etc.) collapse to rectangle.\n\nExtend the mapping to support at least the most common preset shapes:\n1. `triangle` / `rtTriangle` → render as triangle (three-point polygon)\n2. `diamond` → render as rotated rectangle (45 degree)\n3. `roundRect` → render as rectangle with rounded corners\n4. `pentagon` / `hexagon` / `octagon` → render as regular polygon approximations\n5. `arrow` / `rightArrow` / `leftArrow` / `upArrow` / `downArrow` → render as arrow shapes\n6. `star4` / `star5` / `star6` → render as star approximations\n\nThe rendering can use Typst's `#polygon()` or `#path()` functions for non-rectangular shapes. The key is to compute vertex positions based on the shape's bounding box (x, y, width, height).\n\nFor shapes that are too complex to approximate, continue using rectangle fallback but emit a `PartialElement` warning.\n\nCheck the existing Shape enum in `crates/office2pdf/src/ir/elements.rs` and extend it if needed.",
      "acceptanceCriteria": [
        "At least 6 additional preset geometries are mapped beyond rect/ellipse/line",
        "Triangle shapes render as triangles, not rectangles",
        "Rounded rectangles render with border-radius",
        "Arrow shapes render with a recognizable arrow form",
        "Unsupported complex shapes still fall back to rectangle with warning",
        "Unit test: PPTX with triangle shape renders as polygon",
        "Unit test: PPTX with roundRect shape renders with rounded corners",
        "cargo test --workspace passes",
        "cargo fmt --all -- --check passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Start by reading the existing shape handling in pptx.rs and typst_gen.rs. Typst supports #polygon() for arbitrary polygons and #rect(radius: ...) for rounded rectangles. For arrow shapes, a polygon with 7 vertices works well. Calculate vertex positions relative to the bounding box. Don't try to support ALL OOXML presets — focus on the most visually impactful ones."
    },
    {
      "id": "US-086",
      "title": "Improve SmartArt and Chart fallback rendering",
      "description": "SmartArt (`crates/office2pdf/src/render/typst_gen.rs:618`) renders as a simple list box, and Charts (`crates/office2pdf/src/render/typst_gen.rs:558`) render as a data table. Both lose significant visual information.\n\nImprove the fallbacks:\n\n**Charts:**\n1. Read the chart IR data (series names, data points, chart type)\n2. For bar/column charts: render a simple text-based bar chart using Typst boxes with proportional widths\n3. For pie charts: render as a legend table with percentage labels\n4. For line charts: render as a data table with trend indicators (↑↓→)\n5. Always include the chart title prominently\n6. Wrap in a bordered box with \"Chart: [title]\" header\n\n**SmartArt:**\n1. Read the SmartArt IR data (nodes with text and hierarchy level)\n2. For hierarchy/org chart types: render as indented tree with connecting lines (using Typst's indent)\n3. For process/cycle types: render as numbered steps with arrows between them\n4. For list types: render as styled bullet list with boxes\n5. Wrap in a bordered box with visual distinction from normal content\n\nThe goal is not pixel-perfect reproduction but significantly better visual representation than the current fallbacks.",
      "acceptanceCriteria": [
        "Chart fallback includes chart title prominently",
        "Bar/column chart fallback shows proportional visual bars",
        "SmartArt hierarchy fallback shows indented tree structure",
        "SmartArt process fallback shows numbered steps",
        "All chart/SmartArt fallbacks are wrapped in visually distinct bordered boxes",
        "Existing fixtures with charts/SmartArt produce improved output",
        "Unit test: chart with bar data renders proportional text bars",
        "Unit test: SmartArt with hierarchy renders indented tree",
        "cargo test --workspace passes",
        "cargo fmt --all -- --check passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Read the Chart and SmartArt IR types in ir/elements.rs to understand what data is available. The Chart struct likely has series/categories/data_points. SmartArt likely has nodes with text and level. Typst can render simple bar charts with #box(width: X%, fill: color)[]. For hierarchy, use nested #pad(left: N*indent)[]. Don't overcomplicate — clear text representation is better than a broken visual one."
    },
    {
      "id": "US-087",
      "title": "Preserve XLSX chart position within sheet layout",
      "description": "Currently (`crates/office2pdf/src/parser/xlsx.rs:667`), XLSX charts are extracted and appended as separate flow pages instead of preserving their in-sheet positioning.\n\nFix:\n1. When parsing XLSX charts, extract their anchor coordinates (from/to cell references or absolute positions from the drawing XML)\n2. Instead of appending charts as separate pages, embed them within the TablePage at the approximate row position\n3. If the chart's anchor row is row N, insert the chart block between row N-1 and row N in the page's content\n4. The chart should render as a bordered block within the sheet flow, sized according to its anchor dimensions\n5. If anchor position cannot be determined, fall back to appending at the end of the sheet (current behavior)\n\nThis requires changes to:\n- `parser/xlsx.rs` — extract chart anchor position during parsing\n- `ir/elements.rs` or `ir/document.rs` — possibly add chart positioning data to TablePage\n- `render/typst_gen.rs` — render chart at correct position within table output",
      "acceptanceCriteria": [
        "XLSX charts render within their sheet at approximate anchor position",
        "Chart position is derived from drawing anchor (from/to cell references)",
        "Charts without anchor data fall back to end-of-sheet placement",
        "Chart is visually distinct within the sheet flow (bordered box)",
        "Unit test: XLSX with chart at row 5 renders chart between rows 4-5",
        "Unit test: XLSX with chart without anchor renders at sheet end",
        "cargo test --workspace passes",
        "cargo fmt --all -- --check passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "XLSX drawings are in `xl/drawings/drawingN.xml` with anchor elements like <xdr:twoCellAnchor> containing <xdr:from><xdr:row> and <xdr:to><xdr:row>. The umya-spreadsheet library may expose chart anchoring info. If not, parse the drawing XML directly from the ZIP. The key insight is to convert the anchor row number to an insertion point in the parsed table rows."
    },
    {
      "id": "US-088",
      "title": "Build metric-compatible font substitution table",
      "description": "When Microsoft fonts (Calibri, Cambria, Arial, Times New Roman, etc.) are not installed, the PDF output has layout shifts because the fallback fonts have different metrics.\n\nImplement a font substitution table that maps common Microsoft fonts to metric-compatible open-source alternatives:\n\n1. Create a font substitution module (e.g., `crates/office2pdf/src/render/font_subst.rs`)\n2. Define the mapping:\n   - Calibri → Carlito (or Liberation Sans if Carlito unavailable)\n   - Cambria → Caladea (or Liberation Serif)\n   - Arial → Liberation Sans (or Arimo)\n   - Times New Roman → Liberation Serif (or Tinos)\n   - Courier New → Liberation Mono (or Cousine)\n   - Comic Sans MS → Comic Neue\n   - Verdana → DejaVu Sans\n   - Georgia → DejaVu Serif\n3. In the font resolution code (likely in `render/pdf.rs` MinimalWorld), when a requested font is not found, consult the substitution table before falling back to the default embedded font\n4. Log a warning when font substitution occurs\n5. The substitution table should be a static HashMap or match statement for zero-cost lookup",
      "acceptanceCriteria": [
        "Font substitution table maps at least 8 common Microsoft fonts to open-source alternatives",
        "When a requested font is not found, the substitution table is consulted",
        "A warning is emitted when font substitution is applied",
        "The substitution table is a static lookup (no runtime allocation)",
        "If neither the requested font nor its substitute is available, fall back to embedded default",
        "Unit test: requesting 'Calibri' when not installed returns 'Carlito' (or next fallback)",
        "Unit test: requesting an unknown font returns None from substitution table",
        "cargo test --workspace passes",
        "cargo fmt --all -- --check passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 4,
      "passes": false,
      "notes": "Check how MinimalWorld resolves fonts — look at the World trait implementation, particularly the `font()` method. The substitution should happen at the font resolution layer, not in the parser or codegen. Use a match statement or phf (if already a dependency) for the lookup. The metric-compatible fonts listed above are the standard mappings used by LibreOffice and Google Docs. Only map fonts — don't bundle the substitute fonts themselves (they need to be installed on the system)."
    },
    {
      "id": "US-089",
      "title": "PDF output size optimization via stream compression and font subsetting",
      "description": "PDF output files may be larger than necessary due to uncompressed streams or non-subsetted fonts.\n\nOptimize PDF output size:\n1. Check if typst-pdf already applies deflate compression to content streams — if not, investigate if it can be enabled via options\n2. Check if font subsetting is already applied — typst-pdf should subset fonts by default, but verify\n3. For images embedded in the PDF, check if they're being re-encoded or passed through. If images are decoded and re-encoded as uncompressed, that's a significant size issue\n4. Add a `--compress` CLI flag (or make it default) that enables maximum PDF compression\n5. Add a test that measures output file size for a reference document and asserts it's within a reasonable range\n6. Document the expected file sizes for reference documents\n\nThis is primarily about verifying and configuring existing behavior in typst-pdf, not reimplementing compression.",
      "acceptanceCriteria": [
        "PDF output uses deflate compression for content streams",
        "Font subsetting is verified to be active (only used glyphs are embedded)",
        "Images are not unnecessarily re-encoded to larger formats",
        "Test: 10-page DOCX produces PDF < 500KB (without images)",
        "Test: PPTX with images produces PDF proportional to original image sizes",
        "Document compression behavior and expected sizes in code comments",
        "cargo test --workspace passes",
        "cargo fmt --all -- --check passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 5,
      "passes": false,
      "notes": "This story is more investigative than coding-heavy. Start by examining the typst-pdf API and its PdfOptions/export settings. Check if there's a compression level setting. Then measure actual output sizes for existing fixtures and compare to expected sizes. The Typst team maintains typst-pdf so compression should already be good — but verify. If typst-pdf handles everything well, the story becomes mostly about adding size regression tests."
    }
  ]
}
